"""
Тесты для функции is_full_connected модуля full.
"""

from package.full import is_full_connected


def test_is_full_connected():
    """
    Тест на полносвязность сети.
    """

    assert is_full_connected(5, 10, [(0, 1), (0, 2), (0, 3), (0, 4), (1, 2),
                                     (1, 3), (1, 4), (2, 3), (2, 4), (3, 4)])


def test_is_not_full_connected():
    """
    Тест на неполносвязность сети. Неполный ввод.
    """

    assert not is_full_connected(5, 10, [(0, 1), (0, 2), (0, 3), (0, 4),
                                         (1, 2), (1, 3), (1, 4), (2, 3),
                                         (2, 4)])


def test_is_not_full_odd_1():
    """
    Тест на неполносвязность сети. Полный ввод, лишняя связь.
    """

    assert not is_full_connected(5, 10, [(0, 1), (0, 2), (0, 3), (0, 4),
                                         (1, 2), (1, 3), (1, 4), (2, 3),
                                         (2, 4), (3, 1)])


def test_is_not_full_odd_2():
    """
    Тест на неполносвязность сети. Полный ввод, некорректная связь.
    """

    assert not is_full_connected(5, 10, [(0, 1), (0, 2), (0, 3), (0, 4),
                                         (1, 2), (1, 3), (1, 4), (2, 3),
                                         (2, 4), (3, 100)])


def test_is_not_full_odd_3():
    """
    Тест на неполносвязность сети. Полный ввод, неверное число связей.
    """

    assert not is_full_connected(5, 100, [(0, 1), (0, 2), (0, 3), (0, 4),
                                          (1, 2), (1, 3), (1, 4), (2, 3),
                                          (2, 4), (3, 4)])


def test_is_not_full_odd_4():
    """
    Тест на неполносвязность сети. Полный ввод, неверное число ребер.
    """

    assert not is_full_connected(50, 10, [(0, 1), (0, 2), (0, 3), (0, 4),
                                          (1, 2), (1, 3), (1, 4), (2, 3),
                                          (2, 4), (3, 4)])
