"""
Пакет, решающий задачу "О топологии сетей".

Шенберг Аркадий Алексеевич. КИ21-17/1Б. Практическая работа 6. Вариант 11.

Модули:
---------
input:
    Модуль, выполняющий проверку входных данных.

connections:
    Модуль, который вычисляет тип неполносвязной сети.

full:
    Модуль, который вычисляет полносвязность сети.

Внутренний пакет tests:
---------
    test_connections:
        Модуль, содержащий тесты для функции connection_type модуля
            connections.

    test_full:
        Модуль, содержащий тесты для функции is_full_connected модуля full.
"""